org-files/blogging.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-01 Mon 15:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="dennyzhang" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcab1243">1. Introduction of myself and this website</a>
<ul>
<li><a href="#orga5e48f4">1.1. Basic Intro &amp;&amp; Set the context for LLM's collobration</a></li>
<li><a href="#orgf7c2d14">1.2. Target Audience:</a></li>
<li><a href="#org21e8feb">1.3. Current Progress:</a></li>
<li><a href="#org1516254">1.4. Task:</a></li>
<li><a href="#org67f6679">1.5. Additional Guidance:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgcab1243" class="outline-2">
<h2 id="orgcab1243"><span class="section-number-2">1.</span> Introduction of myself and this website</h2>
<div class="outline-text-2" id="text-1">

:HUGO_URL: <a href="https://quantcodedenny.com/docs/posts/self-intro/">https://quantcodedenny.com/docs/posts/self-intro/</a>

:EXPORT_FILE_NAME: self-intro
:EXPORT_DATE: 2025-08-25
:EXPORT_HUGO_SECTION: posts
</div>
<div id="outline-container-orga5e48f4" class="outline-3">
<h3 id="orga5e48f4"><span class="section-number-3">1.1.</span> Basic Intro &amp;&amp; Set the context for LLM's collobration</h3>
<div class="outline-text-3" id="text-1-1">

I am an experienced infra engineer (~20 years) with a personal
project: <a href="https://quantcodedenny.com">https://quantcodedenny.com</a>, hosted on GitHub Pages (repo:
<a href="https://github.com/dennyzhang/quantcodedenny.com/">https://github.com/dennyzhang/quantcodedenny.com/</a>).


I focus on long-term investing in high-tech US stocks. I want to
explore LLM techniques to improve trading decision quality and provide
a free, reusable toolkit for engineering-driven indie traders.
</div>
</div>
<div id="outline-container-orgf7c2d14" class="outline-3">
<h3 id="orgf7c2d14"><span class="section-number-3">1.2.</span> Target Audience:</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Indie traders (not large financial institutions)</li>
<li>Long-term investors (not day traders)</li>
<li>Engineering or technical background</li>
</ul>
</div>
</div>

<div id="outline-container-org21e8feb" class="outline-3">
<h3 id="org21e8feb"><span class="section-number-3">1.3.</span> Current Progress:</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Blog hosted on GitHub Pages with an initial feature: stock sentiment analyzer(<a href="https://quantcodedenny.com/posts/llm-stock-sentiment/">https://quantcodedenny.com/posts/llm-stock-sentiment/</a>)</li>
<li>Targeting long-term tech investors with engineering backgrounds</li>
</ul>
</div>
</div>
<div id="outline-container-org1516254" class="outline-3">
<h3 id="org1516254"><span class="section-number-3">1.4.</span> Task:</h3>
<div class="outline-text-3" id="text-1-4">

You are a world-class entrepreneur, market analyst, and product strategist. Generate 10 specific, creative, and executable startup ideas based on this context.


For each idea, include:
<ol class="org-ol">
<li>Elevator Pitch (1 sentence) – Clear, concise, value-focused.</li>
<li>Target User / Customer Segment – Who will use it.</li>
<li>Key Pain Point Solved – Specific problem addressed.</li>
<li>Monetization Method – How this idea could generate revenue.</li>
<li>Unique Angle or Moat – Differentiation, defensibility, or competitive advantage.</li>
</ol>
</div>
</div>

<div id="outline-container-org67f6679" class="outline-3">
<h3 id="org67f6679"><span class="section-number-3">1.5.</span> Additional Guidance:</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Make ideas actionable, not abstract.</li>
<li>Ask follow-up questions if needed to refine ideas.</li>
<li>Focus on products/tools that fit an engineer-friendly, long-term trading toolkit.</li>
<li>Suggest ideas that can be prototyped quickly or published online.</li>
</ul>


Meta Prompt:
After generating the 5 ideas, suggest a P0 task I can realistically execute in the next 2 hours to make concrete progress on my project.
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: dennyzhang</p>
<p class="date">Created: 2025-09-01 Mon 15:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
